{
  "title": "A Floresta da Destruição",
  "description": "Ian Livingstone Doom Forest adaptado para o sistema D20",
  "starting_node_id": "intro",
  "nodes": [
    {
      "node_id": "intro",
      "title": "História",
      "description": "Você é um aventureiro, um espadachim de aluguel, e tem estado perambulando pelas áreas fronteiriças do norte de seu reino. Tendo sempre desprezado a monotonia da vida de aldeia, você agora vagueia pela região em busca de riquezas e perigo. Apesar das longas caminhadas e da dureza da vida ao ar livre, você está satisfeito com seu destino incerto. Não há nada no mundo que possa lhe inspirar medo, uma vez que você é um guerreiro habilidoso, com muita prática na arte de eliminar homens e animais cruéis com sua espada de confiança. Nem uma só vez, durante os últimos dez dias em que esteve viajando nas áreas fronteiriças do norte, você avistou alguma outra pessoa. Isso não o preocupa em nada, uma vez que você fica feliz na companhia de si mesmo e aprecia os dias lentos e ensolarados, caçando, comendo e dormindo.\nÉ noite, e, tendo degustado um jantar de coelho assado no espeto numa fogueira ao ar livre, você se instala para dormir embaixo de seu cobertor de pelo de carneiro. Há uma lua cheia, e a luz cintila na lâmina de sua espada de lâmina larga, cravada no chão a seu lado. Você fica olhando para ela, imaginando quando será a próxima vez em que terá que limpar o sangue de alguma criatura abjeta de sua lâmina afiada. Estas são terras estranhas, habitadas por feras repulsivas e fantásticas - goblins, trolls e até mesmo dragões.\nEnquanto a chama do fogo de seu acampamento vai morrendo aos poucos, você começa a cair no sono, e imagens de trolls de rostos esverdeados que gritam cruzam velozmente sua mente. De repente, nas moitas à sua esquerda você ouve um estalo alto de uma galho que se quebra sob um pé desajeitado. Você salta de pé e pega sua espada n chão. Fica de pé, imóvel mas alerta, pronto para investir contra o seu adversário ainda fora de vista. Em seguida, você ouve um gemido, seguido pelo ruído seco de um corpo caindo ao chão. Será uma armadilha? Lentamente, você caminha na direção da moita de onde o barulho está vindo e cuidadosamente afasta os galhos. Ao olhar para baixo, você vê um velhinho bem pequeno com uma grande barba cerrada, seu rosto contorcido em dores. Você se agacha para retirar o elmo de ferro que cobre sua cabeça já meio calva e repara nas duas setas de besta que estão cravadas no seu tronco gorducho e protegido por uma cota de malha de ferro. Erguendo-o, você o carrega até perto do fogo e aviva as brasas já quase apagadas. Depois de cobri-lo com o cobertor de pele de carneiro, você consegue que o velho beba um pouco de água. Ele tosse e geme. Senta-se então rigidamente, os olhos fixos à sua frente, e começa a gritar.\n\"Vou pegá-los! Vou pegá-los! Não se preocupe, Gillibran, Perna Grande está vindo para lhe trazer o martelo. Ah, sim, sem dúvido que estou. Ah sim...\"\nO anão, cujo nome você presume que seja Perna Grande, está obviamente delirando por causa dos dardos de ponta envenenada alojados em seu estômago. Você fica observando, enquanto ele desaba novamente no chão, depois sussura o nome dele em seu ouvido. Seus olhos o encaram fixamente, e ele começa de novo a gritar.\n\"Emboscada! Emboscada! Cuidado! Aaaaah! O martelo! Leve o martelo a Gillibran! Salve os anões!\"\nSeus olhos ficam meio fechados, e a dor parece diminuir um pouco. À medida em que o delírio vai se acalmando, ele fala com você de novo num murmúrio baixo.\n\"Ajude-me amigo... leve o martelo para Gillibran... somente o martelo unirá o nosso povo contra os trolls... Nós estavamos a caminho de Darkwood em busca do martelo... emboscados pelo povo pequeno... outros mortos... o mapa no meu alforje o levará à casa de Yaztromo, o mago mais poderoso dessa região... ele tem grandes mágicas para vender que o protegerão das criaturas de Darkwood. Leve meu ouro... eu imploro a você que encontre o martelo e o leve a Gillibran, meu senhor de Stonebridge... você será recompensado...\"\nPerna Grande abre a boca para começar outra frase, mas não emite nada, a não ser seu último suspiro antes de morrer. Você senta e analisa as palavras de Perna Grande. Quem é Gillibran? Quem é Yaztromo? Por que tanto alvorço por causa do martelo dos anões? Você estende a mão até o corpo inerte de Perna Grande e retira o alforje do cinto de couro em volta da cintura. No interior dele, você encontra 30 peças de ouro e um mapa.\nCom as moedas tilintando na sua mão, você fica pensando nas possíveis recompensas que podem estar esperando por você somente por trazer de volta um martelo a uma aldeia de anões. Você resolve tentar encontrar o martelo na Floresta de Darkwood. Já se passaram algumas semanas desde sua última boa batalha, e, ainda mais importante, você provavelmente será bem pago por essa.\nTendo se decidido, você se instala para dormir, depois de pegar a pele de carneiro de volta do pobre Perna Grande. De manhã, você enterra o velho anão e reúne suas posses. Você examina o mapa, olha para o sol e estabele sua posição. Assobiando alegremente, você parte na direção do sul em boa velocidade, ansioso para encontrar este home Yaztromo e ver o que ele tem para oferecer.",
      "choices": [
        {
          "text": "Continue",
          "target": "1"
        }
      ]
    },
    {
      "node_id": "1",
      "title": "Casa do Yastromo",
      "description": "Sua caminhada até a casa de Yaztromo leva um pouco mais da metade de um dia, e você chega à torre de pedra onde ele habita sujo e com fome. Como a torre fica afastada na periferia de Darkwood, a uns cinquenta metros de distância da trilha que você estava seguindo, não é fácil encontrá-la. Finalmente, você chega junto à imensa porta de carvalho, de certa forma aliviado por descobrir que de fato a torre existe, e que Perna Grande não estava falando loucuras em seu delírio. Um grande sino de metal e um gongo pendem do arco de pedra. Ao tocar o sino, um calafrio percorre a sua espinha, e você se dá conta de que o som alto invade um silêncio profundo no qual você não tinha reparado antes. Não se ouvem ruídos de animais ou pássaros. Você espera ansiosamente junto à porta e ouve passadas lentas que descem escadas vindas da torre acima. Uma pequena portinhola de madeira se abre, e dois olhos aparecem, examinando você.\n\"Bem, quem é você?\" - pergunta uma voz aborrecida através do orifício.\nVocê responde que é um aventureiro em busca do poderoso mago Yaztromo, tendo a intenção de adquirir alguns artigos mágicos dele para combater as criaturas da Floresta de Darkwood.\n\"Ah, bem, nesse caso, se você está interessado em comprar algumas mercadorias minhas, é melhor subir. Eu sou Yaztromo.\"\nEle então se volta e sobe lentamente os degraus de pedra.\nVocê:",
      "choices": [
        {
          "text": "Subirá as escada atrás dele?",
          "target": "261"
        },
        {
          "text": "Desembainhará sua espada para atacá-lo?",
          "target": "54"
        }
      ]
    },
    {
      "node_id": "2",
      "title": "FIM",
      "description": "Sua aventura termina aqui, quando sua carne freca e saborosa está prestes a se tornar um apetitoso festim para o vitorioso Ghoul.",
      "is_defeat": true
    },
    {
      "node_id": "3",
      "title": "3",
      "description": "Você segue mais cinco setas até o tronco de uma velha árvore já morta, mas inda enraízada no solo. Você vê que o tronco é oco, o que o buraco continua pelo chão adentro, formando um túnel. Está escuro no buraco, e você não consegue ver a que distância está o fundo. Você tem um Anel de Luz?",
      "choices": [
        {
          "text": "Sim.",
          "target": "322",
          "requirements": {
            "item": "Anel de Luz"
          }
        },
        {
          "text": "Não.",
          "target": "120"
        }
      ]
    },
    {
      "node_id": "4",
      "title": "Flechada no ombro",
      "description": "A flecha atingiu seu ombro. Se ainda estiver vivo, consegue arrancar a flecha de seu ombro, ainda que cause grande agonia.",
      "traps": [
        {
          "type": "flechada",
          "dc": 30,
          "damage": "2d4",
          "save_type": "reflex"
        }
      ],
      "choices": [
        {
          "text": "Entre na caverna.",
          "target": "49"
        },
        {
          "text": "Se arraste de volta para a encruzilhada.",
          "target": "93"
        }
      ]
    },
    {
      "node_id": "5",
      "title": "5",
      "description": "Sentado no trono ornamentado, você se sente estranhamente desconfortável. Os dois guerreiros-clones rastejam no chão à sua frente em completa subserviência. Será que eles esperam que você se torne o novo senhor deles?",
      "choices": [
        {
          "text": "Colque a coroa de ouro sobre sua cabeça.",
          "target": "333"
        },
        {
          "text": "Saia do nicho e suba o restante dos degraus até o teto da caverna.",
          "target": "249"
        }
      ]
    },
    {
      "node_id": "6",
      "title": "6",
      "description": "Quando você passa andando pelo Goblin, ele rosna de uma maneira que você jamais havia ouvido antes, um rosnado que você não esperaria que viesse de um goblin.",
      "choices": [
        {
          "text": "Sentindo-se um pouco nervoso, você segue rapidamente para o norte.",
          "target": "148"
        }
      ]
    },
    {
      "node_id": "7",
      "title": "Abelhas assassinas",
      "description": "Você puxa sua espada e se prepara para enfrentar os agressores de corpos listrados em preto e amarelo. São ABELHAS ASSASSINAS. Elas atacarão em enxames separados, cada enxame contando como uma única criatura.",
      "monsters": [
        "Abelhas_Assassinas"
      ],
      "choices": [
        {
          "text": "Derrotou enxame 1",
          "target": "enxame2"
        }
      ]
    },
    {
      "node_id": "enxame2",
      "title": "ABELHAS ASSASSINAS 2",
      "description": "O segundo enxame ataca.",
      "monsters": [
        "Abelhas_Assassinas"
      ],
      "choices": [
        {
          "text": "Vitória, mas um terceiro enxame se aproxima.",
          "target": "enxame3"
        }
      ]
    },
    {
      "node_id": "enxame3",
      "title": "ABELHAS ASSASSINAS",
      "description": "Outro enxame ataca. Parece que eles nunca acabam!",
      "monsters": [
        "Abelhas_Assassinas"
      ],
      "choices": [
        {
          "text": "Finalmente você conseguiu derrotar as abelhas assassinas.",
          "target": "23"
        }
      ]
    },
    {
      "node_id": "8",
      "title": "8",
      "description": "Seguindo ao longo da trilha, você ouve passos e vozes que discutem adiante.",
      "choices": [
        {
          "text": "Siga ao encontro dos donos das vozes.",
          "target": "317"
        },
        {
          "text": "Se esconda no mato e deixa que eles passem.",
          "target": "392"
        }
      ]
    },
    {
      "node_id": "9",
      "title": "9",
      "description": "Você destranca a porta e dá um passo atrás, desembainhando sua espada caso o goblin tente lhe atacar. Ele apanha um banco de madeira e, brandindo o objeto no ar, abre a porta com um pontapé e avança sobre você aos gritos. Você terá que lutar.",
      "monsters": [
        "goblin"
      ],
      "choices": [
        {
          "text": "victory",
          "target": "176"
        }
      ]
    },
    {
      "node_id": "10",
      "title": "10",
      "description": "Você apanha uma pedra de bom tamanho do chão e faz pontaria. Em seguida, lança a pedra com toda a sua força no Ogro, mas fica decepcionado ao vê-la passar voando por sobre sua cabeça e se espatifar contra a parede do outro lado da caverna. Você solta um palavrão, mas resolve, ainda assim, avançar pela caverna para atacar o Ogro.",
      "choices": [
        {
          "text": "Continue.",
          "target": "290"
        }
      ]
    },
    {
      "node_id": "11",
      "title": "11",
      "description": "Você começar a perder o equilíbrio à medida em que a ilusão vai distorcendo sua mente. Você fecha os olhos e segura a cabeça nas mãos, mas não adianta nada. Você gira às cegas pelo aposento e depois cai no chão inconsciente.",
      "choices": [
        {
          "text": "Continue.",
          "target": "353"
        }
      ]
    },
    {
      "node_id": "12",
      "title": "12",
      "description": "Você diz ao gnomo que talvez tenha sido um pouco precipitado ao desembainhar a espada, mas, tinha de estar preparado para tudo nos limites da cruel Floresta de Darkwood. Ele replica que isso não é desculpa para puxar uma arma diante de um velho indefeso, e que, se você quiser sua espada de volta, isso lhe custará 10 peças de ouro ou dois itens de sua mochila.",
      "choices": [
        {
          "text": "Pague 10 moedas de ouro.",
          "target": "pague10ouros"
        },
        {
          "text": "Dê dois itens de sua mochila.",
          "target": "2itensdamochila"
        }
      ]
    },
    {
      "node_id": "pague10ouros",
      "title": "Pague 10 ouros ao Gnomo",
      "description": "Você paga 10 ouros ao gnomo e ele devolve sua espada.",
      "treasure": [
        "Longsword"
      ],
      "choices": [
        {
          "text": "Continue a conversar com o gnomo.",
          "target": "271"
        },
        {
          "text": "Siga pela trilha oeste.",
          "target": "67"
        }
      ],
      "gold_cost": 10
    },
    {
      "node_id": "13",
      "title": "13",
      "description": "As vibrações atingem seu corpo como ondas de choque que o martelassem. Suas pernas parecem chumbo, e você não consegue mexê-las. De repente, a cabana desaba e vem ao chão. O céu escurece, um vento começa a uivar à sua volta. Venta cada vezx mais forte, chegando a atingir a força de uma tempestade e acabando por derrubar você ao chão. Você se agarra na varanda e protege o rosto da sujeira e dos detritos que a tempestade faz voar pelo ar. Mais alto do que o ruído ensurdecedor do vento, você ouve uma risada, seguida por uma voz profunda que exulta: \"Estou livre! Estou livre!\" Você libertou um ELEMENTO DA TERRA no mundo. Gradualmente, o vento uivante vai morrendo, e o céu clareia. Levantando-se em meio aos destroços, você caminha lentamente de volta à trilha para prosseguir rumo ao norte.",
      "choices": [
        {
          "text": "Continue.",
          "target": "149"
        }
      ]
    },
    {
      "node_id": "14",
      "title": "14",
      "description": "O fosso é circular com lados lisos, e você está fraco demais para sair escalando. Você grita por ajuda, mas ninguém vem para socorrer. Você senta e analisa a sua situação. Depois de uma hora de espera mais ou menos, você ouve um barulho lá no alto. Você olha para cima e vê o rosto barbado de um homem robusto com um chapéu de pele. Ele parece aborrecido. Trata-se de um caçador de animais de pele valiosa, e você arruinou a armadilha dele. Ele grita para você lá de cima que, se espera que ele jogue uma corda para que você suba, isso vai custar 3 peças de ouro. Em substituição a esta quantia, ele aceitará qualquer artigo mágico que você queira ceder a ele dentre os que estão em sua mochila. Depois que você concorda em pagar ao zangado caçador, ele joga uma corda para que você possa subir e sair do poço. Você entrega a taxa combinada, cortando-a da sua lista de equipamentos e encara o caçador pouco amigável com raiva antes de prosseguir para o norte, descendo a garganta.",
      "choices": [
        {
          "text": "Continue para o norte.",
          "target": "255"
        }
      ],
      "gold_cost": 3
    },
    {
      "node_id": "15",
      "title": "15",
      "description": "A enconsta é íngreme, e você escorrega na gosma, rolando pelo buraco até o fundo de uma grande caverna barrenta. Você salta de pé e fica alarmado ao ver a ponta brilhante do ferrão venenoso na extremidade da cauda de um enorme VERME DE PEÇONHA que está vindo na sua direção. O Verme de Peçonha tem uns cinco metros de comprimento, e seus segmentos amarelos são imensos, mas você está preocupado em proteger-se do ferrão. Não há tempo para fugir para fora do buraco - você tem que desembainhar sua espada e lutar.",
      "monsters": [
        "VERME DE PEÇONHA"
      ],
      "choices": [
        {
          "text": "Continue",
          "target": "217"
        }
      ]
    },
    {
      "node_id": "16",
      "title": "16",
      "description": "Você grita para os três humanóides que estão cuidando de um roçado de fungos de topo vermelho. Outra vez eles ignoram sua presença, continuando o trabalho deles. Você pega um dos fungos, parte um pedaço do topo e começa a comer. O gosto é bom, mas uma dor terrível invade seu estômgao. O fungo é venenoso. Você tem uma Poção Antiveneno?",
      "choices": [
        {
          "text": "Não",
          "target": "345"
        },
        {
          "text": "Sim.",
          "target": "211",
          "requirements": {
            "item": "Poção Antiveneno"
          }
        }
      ]
    },
    {
      "node_id": "17",
      "title": "17",
      "description": "Uma escada desce pelo interior do poço até a água lá embaixo. Contudo, parece haver um túnel logo acima da superfície da água, o qual segue para o norte. É circular, e tem o diâmetro de um metro. Você pode:",
      "choices": [
        {
          "text": "Jogar uma peça de ouro no poço para fazer um pedido.",
          "target": "89"
        },
        {
          "text": "Descer a escada para olhar o túnel.",
          "target": "256"
        },
        {
          "text": "Retornar à trilha para seguir para o oeste.",
          "target": "238"
        }
      ]
    },
    {
      "node_id": "18",
      "title": "18",
      "description": "Seu plano funciona, e a febre diminui. Felizmente, os pelos nas costas de suas mãos desaparecem, e você cai de novo em sono profundo, exausto. De manhã, você reúne seus pertences e parte para o norte pela trilha, na direção das montanhas.",
      "choices": [
        {
          "text": "Continue.",
          "target": "198"
        }
      ]
    },
    {
      "node_id": "19",
      "title": "19",
      "description": "Embora fraco por causa da febre, você consegue sentar. Segura então sua espada e, apertando os dentes, você corta a si mesmo no lugar onde for a mordida do lobisome. O sangue corre rapidamente do ferimento e, com sorte, leva com ele a doença. Você perde força devido a perda de sangue.",
      "traps": [
        {
          "type": "corte superficial",
          "dc": 30,
          "damage": "1d4",
          "save_type": "fortitude"
        }
      ],
      "choices": [
        {
          "text": "Continue.",
          "target": "18"
        }
      ]
    },
    {
      "node_id": "20",
      "title": "20",
      "description": "Caminhando para o leste, você se depara com uma ramificação da trilha que seuge para o sul. Você decide ignorar isso e continua para o leste.",
      "choices": [
        {
          "text": "Continue para o leste.",
          "target": "277"
        }
      ]
    },
    {
      "node_id": "21",
      "title": "21",
      "description": "A dor aumenta, e você rapidamente procura em sua mochila e retira a pequena garrafa com o rótulo de Poção Antiveneno. Você engole o cnteúdo. Seu corpo relaxa, e os efeitos do veneno vão sumindo. Você fica imaginando o que mais está reservado para você nessa floresta e volta-se para o norte, subindo a trilha.",
      "choices": [
        {
          "text": "Continue para o norte.",
          "target": "226"
        }
      ],
      "item_cost": {
        "Poção Antiveneno": 1
      }
    },
    {
      "node_id": "22",
      "title": "22",
      "description": "O gás é tóxico, e seus olhos começam a lacrimejar. Você tosses e prende a respiração, correndo em volta da caverna para tentar escapar da nuvem de gás que envolve seu rosto. Seus pulmões parecem estar explodindo, e você é forçado a inspirar. Se ainda estiver vivo, você viado ao ver a nuvem de gás ir se dissipando. Você colocar a caixa de prata na sua mochila e sai da caverna imediatamente para continuar na direção do norte em sua missão.",
      "treasure": [
        "Caixa de Prata"
      ],
      "traps": [
        {
          "type": "Nuvem de gás tóxico",
          "dc": 30,
          "damage": "1d6",
          "save_type": "fortitude"
        }
      ],
      "choices": [
        {
          "text": "Continue.",
          "target": "358"
        }
      ]
    },
    {
      "node_id": "23",
      "title": "23",
      "description": "Você enxuga o suor da sua testa e fica imaginando o que mais essas terras cruéis terão reservado para você. Você senta e descansa um puco. Depois, parte na direção do som de água corrente.\nENDD",
      "choices": [
        {
          "text": "Continue",
          "target": "339"
        }
      ]
    },
    {
      "node_id": "24",
      "title": "24",
      "description": "Os músculos de seu pescoço começam a endurecer, e você sente os efeitos do veneno dos dardos percorrendo seu corpo. Você procura rapidamente na sua mochila e retira a pequena garrafa com o rótulo Poção Antiveneno, depois engole o conteúdo. Seu corpo relaxa, e os efeitos do veneno vão sumindo. Ao ver isso, os Pigmeuss voltam-se e fogem para o mato. Você:",
      "choices": [
        {
          "text": "Desembainhará sua espada e correrá para o mato na perseguição dos Pigmeus?",
          "target": "377"
        },
        {
          "text": "Continuará para o norte pela trilha?",
          "target": "92"
        }
      ],
      "item_cost": {
        "Poção Antiveneno": 1
      }
    },
    {
      "node_id": "25",
      "title": "25",
      "description": "A trilha acaba por se tornar plana, e você se vê no fundo de um vale. A trilha também continua para o norte, mas há um novo caminho que leva na direção do oeste.",
      "choices": [
        {
          "text": "Continue para o norte",
          "target": "369"
        },
        {
          "text": "Continue para o oeste",
          "target": "56"
        }
      ]
    }
  ],
  "custom_monsters": {
    "Abelhas_Assassinas": {
      "hit_dice": "1d4",
      "armor_class": 10,
      "attack_bonus": 0,
      "damage": "1d4",
      "special_abilities": [],
      "treasure": []
    },
    "VERME DE PEÇONHA": {
      "hit_dice": "2d8",
      "armor_class": 12,
      "attack_bonus": 2,
      "damage": "1d8",
      "special_abilities": [
        "poison"
      ],
      "treasure": [
        "10"
      ]
    }
  }
}